Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения) 
	СуммаПоДокументу = СписокНоменклатуры.Итог("Сумма");
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)    
	
	Движения.ОстаткиНоменклатуры.Записывать = Истина;
	Движения.ПартииНоменклатуры.Записывать = Истина;
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ 
	
	                            | ПриходнаяНакладнаяСписокНоменклатуры.Номенклатура КАК Номенклатура,
	                            |	&Склад КАК Склад,
	                            |	ПриходнаяНакладнаяСписокНоменклатуры.Ссылка КАК Партия,
	                            |	ПриходнаяНакладнаяСписокНоменклатуры.Количество КАК Количество,
	                            |	ПриходнаяНакладнаяСписокНоменклатуры.Сумма КАК Стоимость,
	                            |	&Период КАК Период
	                            |ИЗ
	                            |	Документ.ПриходнаяНакладная.СписокНоменклатуры КАК ПриходнаяНакладнаяСписокНоменклатуры
	                            |
	                            |УПОРЯДОЧИТЬ ПО
	                            |	Склад,
	                            |	Номенклатура,
	                            |	Количество,
	                            |	Период,
	                            |	Сумма,
	                            |	ПриходнаяНакладнаяСписокНоменклатуры.Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Склад", Склад);  
	Запрос.УстановитьПараметр("Период", Дата);
	
	 	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл 
		Движение = Движения.ОстаткиНоменклатуры.ДобавитьПриход();
		ЗаполнитьЗначенияСвойств(Движение, Выборка);  
		
		Движение = Движения.ПартииНоменклатуры.ДобавитьПриход();
		ЗаполнитьЗначенияСвойств(Движение, Выборка);

		
	КонецЦикла;
	
	КонецПроцедуры

 





