Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения) 
	СуммаПоДокументу = СписокНоменклатуры.Итог("Сумма");
КонецПроцедуры


Процедура ОбработкаПроведения_простая(Отказ, Режим)


	//// регистр ОстаткиНоменклатуры Расход
	//Движения.ОстаткиНоменклатуры.Записывать = Истина;
	//Для Каждого ТекСтрокаСписокНоменклатуры Из СписокНоменклатуры Цикл
	//	Движение = Движения.ОстаткиНоменклатуры.Добавить();
	//	Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	//	Движение.Период = Дата;
	//	Движение.Номенклатура = ТекСтрокаСписокНоменклатуры.Номенклатура;
	//	Движение.Склад = Склад;
	//	Движение.Количество = ТекСтрокаСписокНоменклатуры.Количество;
	//КонецЦикла;


КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
Результат = РегистрыСведений.УчетнаяПолитика.ПолучитьПоследнее(Дата); 
Если Результат.МетодСписанияСебестоимости = Перечисления.УчетнаяПолитика.ПустаяСсылка() Тогда
	Отказ = Истина;
	
КонецЕсли; 

Сообщение = Новый СообщениеПользователю;
Сообщение.Текст = "Не указан метод списания себестоимости";
Сообщение.Сообщить();  
Возврат;
КонецЕсли;
МетодСписанияСебестоимости = Результат.МетодСписанияСебестоимости; 
		// РН Остаток номенклатуры
	Запрос = Новый Запрос;  
	МенеджерВТ = Новый МенеджерВременныхТаблиц;
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РасходнаяНакладнаяСписокНоменклатуры.Номенклатура КАК Номенклатура,
		|	СУММА(РасходнаяНакладнаяСписокНоменклатуры.Количество) КАК Количество
		|ПОМЕСТИТЬ втТЧТовары
		|ИЗ
		|	Документ.РасходнаяНакладная.СписокНоменклатуры КАК РасходнаяНакладнаяСписокНоменклатуры
		|ГДЕ
		|	РасходнаяНакладнаяСписокНоменклатуры.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	РасходнаяНакладнаяСписокНоменклатуры.Номенклатура
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втТЧТовары.Номенклатура КАК Номенклатура,
		|	втТЧТовары.Количество КАК Количество,
		|	&Период КАК Период,
		|	&Склад КАК Склад,
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения
		|ИЗ
		|	втТЧТовары КАК втТЧТовары";
	
	Запрос.УстановитьПараметр("Период", Дата);
	Запрос.УстановитьПараметр("Склад", Склад);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Движение = Движения.ОстаткиНоменклатуры.Добавить();
		ЗаполнитьЗначенияСвойств(Движение, Выборка)
	КонецЦикла;
	
            Движения.ОстаткиНоменклатуры.Записывать = Истина;
			Движения.Записать();  
			
	
	Запрос = Новый Запрос;    
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОстаткиНоменклатурыОстатки.Номенклатура.Представление КАК НоменклатураПредставление,
		|	ОстаткиНоменклатурыОстатки.КоличествоОстаток КАК КоличествоОстаток
		|ИЗ
		|	РегистрНакопления.ОстаткиНоменклатуры.Остатки(
		|			&Граница,
		|			Склад = &Склад
		|				И Номенклатура В
		|					(ВЫБРАТЬ
		|						Т.Номенклатура
		|					ИЗ
		|						ВтТЧТовары КАК Т)) КАК ОстаткиНоменклатурыОстатки
		|ГДЕ
		|	ОстаткиНоменклатурыОстатки.КоличествоОстаток < 0";
	
	Запрос.УстановитьПараметр("Граница", Новый Граница(МоментВремени(), ВидГраницы.Включая));
	Запрос.УстановитьПараметр("Склад", Склад);
	
	РезультатЗапроса = Запрос.Выполнить();  
	Если Не РезультатЗапроса.Пустой()Тогда
		Отказ=Истина
	Выборка = РезультатЗапроса.Выбрать(); 
		
	Пока Выборка.Следующий() Цикл  
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = СтрШаблон("Недостаточно товара %1 в количестве %2",
		Выборка.НоменклатураПредставление, -ВыборкаКоличествоОстаток);
		
	КонецЦикла; 
		
КонецЕсли;    
Если Отказ Тогда
	Возврат;
	  КонецЕсли;
	
	//  РН Партии номенклатуры  
	Движения.СебестоимостьТоваров.Записывать = Истина;
	Движения.Записать();
	
	Движения.СебестоимостьТоваров.Записывать = Истина;  
	
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	втТЧТовары.Номенклатура КАК Номенклатура, 
		|   втТЧТовары.Номенклатура.Представление КАК НоменклатураПредставление,
		|	втТЧТовары.Количество КАК Количество,
		|	ПартииНоменклатурыОстатки.Партия КАК Партия,
		|	ЕСТЬNULL(ПартииНоменклатурыОстатки.КоличествоОстаток, 0) КАК КоличествоОстаток,
		|	ЕСТЬNULL(ПартииНоменклатурыОстатки.СтоимостьОстаток, 0) КАК СтоимостьОстаток
		|   ПартииНоменклатурыОстатки.Партия.Представление КАК   Партия.Представление
		|ИЗ
		|	втТЧТовары КАК втТЧТовары
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ПартииНоменклатуры.Остатки(
		|				&МоментВремени,
		|				Номенклатура В
		|					(ВЫБРАТЬ
		|						втТЧТовары.Номенклатура КАК Номенклатура
		|					ИЗ
		|						втТЧТовары КАК втТЧТовары)) КАК ПартииНоменклатурыОстатки
		|		ПО втТЧТовары.Номенклатура = ПартииНоменклатурыОстатки.Номенклатура
		|           Упорядочить по
		|            ПартииНоменклатурыОстатки.Партия.МоментВремени
		|ИТОГИ
		|	МАКСИМУМ(Количество),
		|	СУММА(КоличествоОстаток)
		|ПО
		|	Номенклатура";  
	Если МетодСписанияСебестоимости = Перечисления.УчетнаяПолитика.ЛИФО Тогда
		Запрос.Текст = СтрЗаменить( Запрос.Текст, "ПартииНоменклатурыОстатки.Партия.МоментВремени",
		                                           "ПартииНоменклатурыОстатки.Партия.МоментВремени УБЫВ");


	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);  
	Запрос.УстановитьПараметр ("МоментВремени" МоментВремени ());
	
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаНоменклатура = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаНоменклатура.Следующий() Цикл    
		Если ВыборкаНоменклатура.Количество > ВыборкаНоменклатура.КоличествоОстаток Тогда
			  Отказ = Иситна;
			  
			      Сообщение = Новый СообщениеПользователю;
				  Сообщение.Текст = СтрШаблон("Недостаточно товара %1 в количестве %2",
				  ВыборкаНоменклатура.НоменклатураПредставление
				  ВыборкаНоменклатура.Количество - ВыборкаНоменклатура.КоличествоОстаток);
				  Сообщение.Сообщить();
				  
				  Если Отказ Тогда
					  Продолжить;
				  КонецЕсли;
			
			             КоличествоСписать = ВыборкаНоменклатура.Количество;
		
		ВыборкаДетальныеЗаписи = ВыборкаНоменклатура.Выбрать();
	
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл   
			
			Количество = Мин(КоличествоСписать, ВыборкаДетальныеЗаписи.КоличествоОстаток);  
			
			Если Количество = ВыборкаДетальныеЗаписи.КоличествоОстаток Тогда  
				Себестоимость = ВыборкаДетальныеЗаписи.СтоимостьоОстаток;
				
			Иначе 
				Если ВыборкаДетальныеЗаписи.КоличествоОстаток = 0 Тогда 
					Отказ = Истина;
					Сообщение = Новый СообщениеПользователю;
					Сообщение.Текст = СтрШаблон("Обнаружен нулевой остаток по партии %1", ВыборкаДетальныеЗаписи.ПартияПредставление);
					Сообщение.Сообщить();  
					
					Прервать;
					КонецЕсли;

				Себестоимость = ВыборкаДетальныеЗаписи.СтоимостьоОстаток/ВыборкаДетальныеЗаписи.КоличествоОстаток*Количество
									
			КонецЕсли; 
			
	КонецЦикла;
	
	
КонецПроцедуры







